In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4], index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [4]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [5]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [6]:
ranger = range(15)

In [8]:
ranger

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [9]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [10]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],
                   columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.565736 -0.566916 -0.295253  0.982030 -1.006111
B  0.008190  0.028825  0.076540 -0.321769 -0.999069
D  0.850762 -0.717876 -1.631493  1.271240  0.160225
E  0.351895  1.304046  2.418475 -1.187014  0.616151
F  0.248379 -0.413734  0.562465 -0.413531 -0.861525

In [11]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [12]:
dframe2

       col1      col2      col3      col4      col5
A -0.565736 -0.566916 -0.295253  0.982030 -1.006111
B  0.008190  0.028825  0.076540 -0.321769 -0.999069
C       NaN       NaN       NaN       NaN       NaN
D  0.850762 -0.717876 -1.631493  1.271240  0.160225
E  0.351895  1.304046  2.418475 -1.187014  0.616151
F  0.248379 -0.413734  0.562465 -0.413531 -0.861525

In [13]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [14]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.565736 -0.566916 -0.295253  0.982030 -1.006111   NaN
B  0.008190  0.028825  0.076540 -0.321769 -0.999069   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.850762 -0.717876 -1.631493  1.271240  0.160225   NaN
E  0.351895  1.304046  2.418475 -1.187014  0.616151   NaN
F  0.248379 -0.413734  0.562465 -0.413531 -0.861525   NaN

In [15]:
dframe

       col1      col2      col3      col4      col5
A -0.565736 -0.566916 -0.295253  0.982030 -1.006111
B  0.008190  0.028825  0.076540 -0.321769 -0.999069
D  0.850762 -0.717876 -1.631493  1.271240  0.160225
E  0.351895  1.304046  2.418475 -1.187014  0.616151
F  0.248379 -0.413734  0.562465 -0.413531 -0.861525

In [18]:
dframe.loc[['A','B','C','D','E','F'], new_columns]

       col1      col2      col3      col4      col5  col6
A -0.565736 -0.566916 -0.295253  0.982030 -1.006111   NaN
B  0.008190  0.028825  0.076540 -0.321769 -0.999069   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.850762 -0.717876 -1.631493  1.271240  0.160225   NaN
E  0.351895  1.304046  2.418475 -1.187014  0.616151   NaN
F  0.248379 -0.413734  0.562465 -0.413531 -0.861525   NaN